// Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, 
// що потрібні тобі для даної задачі. Також напиши до 5 неправильних імен 
// (неправильні імена повинні бути закоментовані);

// Правила написання змінних в JavaScript:
// Літери, цифри, підкреслення, доларовий знак: Назви змінних можуть містити літери (A-Z, a-z), цифри (0-9), підкреслення (_) та символ долара ($).
// Не починаються з цифри: Назва змінної повинна починатися з літери, підкреслення або символу долара. Вони не можуть починатися з цифри.
// Відчутливі до регістру: Назви змінних розрізняють регістр, тобто "myVar" і "myvar" будуть різними змінними.
// КамелКейс (Camel Case): Для більш читабельного коду зазвичай використовується камелкейс, де перше слово починається з маленької літери, а кожне наступне слово починається з великої. Приклади: myVariableName, userName, totalAmount.
// Означальні назви: Назви змінних повинні бути означальними та відображати сутність змінної. Це полегшує зрозуміння коду і покращує його обслуговування.
// Уникальні назви: Назви змінних повинні бути унікальними в межах свого контексту. Не слід використовувати однакові назви для різних змінних, що може призвести до конфліктів.
// Ключові слова: Не можна використовувати ключові слова мови JavaScript (наприклад, let, if, for, тощо) як назви змінних.

// Правильні імена змінних:
let fulllName;
let nameAndSurname;
let personName;
let userFullname;

// Неправильні імена змінних 
//(змінні не можуть починатись з цифр та містити спеціальні символи окрім "_"):
// let 123name;
// let first-name;
// let full.name;
// let 2surname;
// let for;